In [1]:
import pandas as pd

student = pd.read_table('C:\\Users\\guojl\\Desktop\\example\\data\\students.txt', sep = ',')

In [2]:
print(student)

             id name  age sex class
0    1500100001  施笑槐   22   女  文科六班
1    1500100002  吕金鹏   24   男  文科六班
2    1500100003  单乐蕊   22   女  理科六班
3    1500100004  葛德曜   24   男  理科三班
4    1500100005  宣谷芹   22   女  理科五班
..          ...  ...  ...  ..   ...
995  1500100996  厉运凡   24   男  文科三班
996  1500100997  陶敬曦   21   男  理科六班
997  1500100998  容昆宇   22   男  理科四班
998  1500100999  钟绮晴   23   女  文科五班
999  1500101000  符瑞渊   23   男  理科六班

[1000 rows x 5 columns]

In [3]:
student[student['age']>23]

             id name  age sex class
1    1500100002  吕金鹏   24   男  文科六班
3    1500100004  葛德曜   24   男  理科三班
12   1500100013  逯君昊   24   男  文科二班
18   1500100019  娄曦之   24   男  理科三班
27   1500100028  幸浩邈   24   男  理科五班
..          ...  ...  ...  ..   ...
988  1500100989  柏盼香   24   女  理科六班
991  1500100992  莫运盛   24   男  理科六班
993  1500100994  相凌青   24   女  理科四班
994  1500100995  寿芷卉   24   女  理科五班
995  1500100996  厉运凡   24   男  文科三班

[260 rows x 5 columns]

In [4]:
student[student['age']>=21]

             id name  age sex class
0    1500100001  施笑槐   22   女  文科六班
1    1500100002  吕金鹏   24   男  文科六班
2    1500100003  单乐蕊   22   女  理科六班
3    1500100004  葛德曜   24   男  理科三班
4    1500100005  宣谷芹   22   女  理科五班
..          ...  ...  ...  ..   ...
995  1500100996  厉运凡   24   男  文科三班
996  1500100997  陶敬曦   21   男  理科六班
997  1500100998  容昆宇   22   男  理科四班
998  1500100999  钟绮晴   23   女  文科五班
999  1500101000  符瑞渊   23   男  理科六班

[1000 rows x 5 columns]

In [5]:
student.groupby('class')['id'].count().reset_index().rename(columns={'id':'count'})

   class  count
0   文科一班     72
1   文科三班     94
2   文科二班     87
3   文科五班     84
4   文科六班    104
5   文科四班     81
6   理科一班     78
7   理科三班     68
8   理科二班     79
9   理科五班     70
10  理科六班     92
11  理科四班     91

In [6]:
student.groupby('class')['age'].mean().reset_index().rename(columns = {'age':'mean_age'})

   class   mean_age
0   文科一班  22.416667
1   文科三班  22.680851
2   文科二班  22.379310
3   文科五班  22.309524
4   文科六班  22.605769
5   文科四班  22.506173
6   理科一班  22.333333
7   理科三班  22.676471
8   理科二班  22.556962
9   理科五班  22.642857
10  理科六班  22.489130
11  理科四班  22.637363

In [7]:
score = pd.read_table('C:\\Users\\guojl\\Desktop\\example\\data\\score.txt', sep = ',')

print(score)

              id      num  score
0     1500100001  1000001     98
1     1500100001  1000002      5
2     1500100001  1000003    137
3     1500100001  1000004     29
4     1500100001  1000005     85
...          ...      ...    ...
5989  1500100999  1000002     55
5990  1500100999  1000003    102
5991  1500100999  1000004     48
5992  1500100999  1000005     41
5993  1500100999  1000006     10

[5994 rows x 3 columns]

In [8]:

score.columns

Index(['id', 'num', 'score'], dtype='object')

In [9]:
score.groupby("id")["score"].sum().reset_index().rename(columns={'score':'sum_score'}).sort_values('sum_score', ascending = False).head(10)

             id  sum_score
928  1500100929        630
79   1500100080        628
307  1500100308        628
872  1500100873        612
417  1500100418        611
257  1500100258        604
874  1500100875        595
929  1500100930        589
595  1500100596        587
833  1500100834        586

In [10]:
student.merge(score, on = 'id')

              id name  age sex class      num  score
0     1500100001  施笑槐   22   女  文科六班  1000001     98
1     1500100001  施笑槐   22   女  文科六班  1000002      5
2     1500100001  施笑槐   22   女  文科六班  1000003    137
3     1500100001  施笑槐   22   女  文科六班  1000004     29
4     1500100001  施笑槐   22   女  文科六班  1000005     85
...          ...  ...  ...  ..   ...      ...    ...
5989  1500100999  钟绮晴   23   女  文科五班  1000002     55
5990  1500100999  钟绮晴   23   女  文科五班  1000003    102
5991  1500100999  钟绮晴   23   女  文科五班  1000004     48
5992  1500100999  钟绮晴   23   女  文科五班  1000005     41
5993  1500100999  钟绮晴   23   女  文科五班  1000006     10

[5994 rows x 7 columns]

In [ ]:
import matplotlib.pyplot as plt
df = student.groupby('class')['id'].count().reset_index().rename(columns={'id':'count'})
plt.rcParams['font.family']=['SimHei']
fig,ax = plt.subplots()
ax.plot(df['class'], df['count'])
ax.set_xticklabels(labels=df['class'], rotation=90)  # 旋转90度
plt.show()